import React, { useRef } from 'react';
import WelcomeMessage from './WelcomeMessage';
import InputArea from './InputArea';

const getYear = () => {
  return new Date().getFullYear();
};


const welcomeMessage = `Explore the terminal to learn more about me. 
Start your journey with 'compgen' to discover all the available commands, or use 'help' for guidance on how to use them.`;

const bannerCondensed =
"███╗   ███╗██╗   ██╗████████╗██╗  ██╗██╗   ██╗\n" +
"████╗ ████║██║   ██║╚══██╔══╝██║  ██║██║   ██║\n" +
"██╔████╔██║██║   ██║   ██║   ███████║██║   ██║\n" +
"██║╚██╔╝██║██║   ██║   ██║   ██╔══██║██║   ██║\n" +
"██║ ╚═╝ ██║╚██████╔╝   ██║   ██║  ██║╚██████╔╝\n" +
"╚═╝     ╚═╝ ╚═════╝    ╚═╝   ╚═╝  ╚═╝ ╚═════╝ \n" +
"\n" +
"██╗  ██╗ █████╗ ███╗   ██╗███╗   ██╗ █████╗ ███╗   ██╗\n" +
"██║ ██╔╝██╔══██╗████╗  ██║████╗  ██║██╔══██╗████╗  ██║\n" +
"█████╔╝ ███████║██╔██╗ ██║██╔██╗ ██║███████║██╔██╗ ██║\n" +
"██╔═██╗ ██╔══██║██║╚██╗██║██║╚██╗██║██╔══██║██║╚██╗██║\n" +
"██║  ██╗██║  ██║██║ ╚████║██║ ╚████║██║  ██║██║ ╚████║\n" +
"╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═══╝\n" +
"\n" +
"© " + getYear() + " | Muthu Kannan | Java Full Stack Developer";



const Home: React.FC = () => {
  const inputRef = useRef<HTMLInputElement>(null);

  return (
    <div className="terminal-container">
      <pre className="banner">{bannerCondensed}</pre>
      <WelcomeMessage message={welcomeMessage} inputRef={inputRef} />
      <div className="terminal-input">
        <InputArea />
      </div>
    </div>
  );
};

export default Home;